nthuepl/CodeGenerator/python/sdcc/cc2540relay.h
#define MAP_ATT_BuildErrorRsp                              0xac1
#define MAP_ATT_BuildExchangeMTURsp                        0xacd
#define MAP_ATT_BuildFindByTypeValueRsp                    0xae5
#define MAP_ATT_BuildFindInfoRsp                           0xad9
#define MAP_ATT_BuildHandleValueInd                        0xb39
#define MAP_ATT_BuildPrepareWriteRsp                       0xb2d
#define MAP_ATT_BuildReadBlobRsp                           0xb0f
#define MAP_ATT_BuildReadByGrpTypeRsp                      0xb21
#define MAP_ATT_BuildReadByTypeRsp                         0xaf1
#define MAP_ATT_BuildReadMultiRsp                          0xb1b
#define MAP_ATT_BuildReadRsp                               0xafd
#define MAP_ATT_CompareUUID                                0xb45
#define MAP_ATT_ConvertUUIDto128                           0xb4b
#define MAP_ATT_ErrorRsp                                   0xa67
#define MAP_ATT_ExchangeMTURsp                             0xa6d
#define MAP_ATT_ExecuteWriteRsp                            0xaa9
#define MAP_ATT_FindByTypeValueRsp                         0xa79
#define MAP_ATT_FindInfoRsp                                0xa73
#define MAP_ATT_HandleValueInd                             0xab5
#define MAP_ATT_HandleValueNoti                            0xaaf
#define MAP_ATT_ParseExchangeMTUReq                        0xac7
#define MAP_ATT_ParseExecuteWriteReq                       0xb33
#define MAP_ATT_ParseFindByTypeValueReq                    0xadf
#define MAP_ATT_ParseFindInfoReq                           0xad3
#define MAP_ATT_ParsePacket                                0xabb
#define MAP_ATT_ParsePrepareWriteReq                       0xb27
#define MAP_ATT_ParseReadBlobReq                           0xb09
#define MAP_ATT_ParseReadByTypeReq                         0xaeb
#define MAP_ATT_ParseReadMultiReq                          0xb15
#define MAP_ATT_ParseReadReq                               0xaf7
#define MAP_ATT_ParseWriteReq                              0xb03
#define MAP_ATT_PrepareWriteRsp                            0xaa3
#define MAP_ATT_ReadBlobRsp                                0xa8b
#define MAP_ATT_ReadByGrpTypeRsp                           0xa97
#define MAP_ATT_ReadByTypeRsp                              0xa7f
#define MAP_ATT_ReadMultiRsp                               0xa91
#define MAP_ATT_ReadRsp                                    0xa85
#define MAP_ATT_WriteRsp                                   0xa9d
#define MAP_Accel_AddService                               0x773
#define MAP_Accel_GetParameter                             0x785
#define MAP_Accel_RegisterAppCBs                           0x779
#define MAP_Accel_SetParameter                             0x77f
#define MAP_Batt_AddService                                0x79d
#define MAP_Batt_Register                                  0x7a3
#define MAP_CodeGeneratorStartPoint                        0xa37
#define MAP_CodeGenerator_EVT_1_CB                         0xa1f
#define MAP_CodeGenerator_EVT_2_CB                         0xa25
#define MAP_CodeGenerator_EVT_3_CB                         0xa2b
#define MAP_CodeGenerator_EVT_4_CB                         0xa31
#define MAP_DevInfo_AddService                             0x7bb
#define MAP_DevInfo_SetParameter                           0x7c1
#define MAP_EcoExecProfileChangeCB                         0xa01
#define MAP_EcoExecProfile_AddService                      0x647
#define MAP_EcoExecProfile_GetParameter                    0x653
#define MAP_EcoExecProfile_HandleConnStatusCB              0x665
#define MAP_EcoExecProfile_ReadAttrCB                      0x659
#define MAP_EcoExecProfile_RegisterAppCBs                  0x64d
#define MAP_EcoExecProfile_WriteAttrCB                     0x65f
#define MAP_GAPBondMgr_Init                                0x887
#define MAP_GAPBondMgr_LinkEst                             0x81b
#define MAP_GAPBondMgr_ProcessEvent                        0x88d
#define MAP_GAPBondMgr_ProcessGAPMsg                       0x839
#define MAP_GAPBondMgr_Register                            0x833
#define MAP_GAPBondMgr_ResolveAddr                         0x821
#define MAP_GAPBondMgr_ServiceChangeInd                    0x827
#define MAP_GAPBondMgr_SetParameter                        0x815
#define MAP_GAPBondMgr_UpdateCharCfg                       0x82d
#define MAP_GAPRole_GetParameter                           0x9c5
#define MAP_GAPRole_Init                                   0x9d7
#define MAP_GAPRole_ProcessEvent                           0x9dd
#define MAP_GAPRole_SendUpdateParam                        0x9e9
#define MAP_GAPRole_SetParameter                           0x9bf
#define MAP_GAPRole_StartDevice                            0x9cb
#define MAP_GAPRole_TerminateConnection                    0x9d1
#define MAP_GAP_Authenticate                               0xbe1
#define MAP_GAP_Bond                                       0xbf3
#define MAP_GAP_DeviceInit                                 0x80f
#define MAP_GAP_EndDiscoverable                            0xc59
#define MAP_GAP_GetParamValue                              0xb57
#define MAP_GAP_Init                                       0xca7
#define MAP_GAP_MakeDiscoverable                           0xc4d
#define MAP_GAP_NumActiveConnections                       0xcb3
#define MAP_GAP_ParamsInit                                 0xb5d
#define MAP_GAP_PasscodeUpdate                             0xbed
#define MAP_GAP_PeriDevMgrInit                             0xc5f
#define MAP_GAP_ProcessEvent                               0xcad
#define MAP_GAP_RegisterForHCIMsgs                         0xca1
#define MAP_GAP_ResolvePrivateAddr                         0xbbd
#define MAP_GAP_SecParamsInit                              0xb63
#define MAP_GAP_SendSlaveSecurityRequest                   0xc9b
#define MAP_GAP_SetParamValue                              0xb51
#define MAP_GAP_Signable                                   0xbdb
#define MAP_GAP_TerminateAuth                              0xbe7
#define MAP_GAP_TerminateLinkReq                           0xbd5
#define MAP_GAP_UpdateAdvertisingData                      0xc53
#define MAP_GATTServApp_AddService                         0xdd9
#define MAP_GATTServApp_FindAttr                           0xdd3
#define MAP_GATTServApp_Init                               0xdbb
#define MAP_GATTServApp_InitCharCfg                        0xe45
#define MAP_GATTServApp_ProcessCCCWriteReq                 0xe57
#define MAP_GATTServApp_ProcessCharCfg                     0xe5d
#define MAP_GATTServApp_ProcessEvent                       0xdc1
#define MAP_GATTServApp_ReadAttr                           0xe2d
#define MAP_GATTServApp_ReadCharCfg                        0xe4b
#define MAP_GATTServApp_RegisterForMsg                     0xdb5
#define MAP_GATTServApp_RegisterService                    0xdc7
#define MAP_GATTServApp_SendCCCUpdatedEvent                0xe69
#define MAP_GATTServApp_SendServiceChangedInd              0xe3f
#define MAP_GATTServApp_UpdateCharCfg                      0xe39
#define MAP_GATTServApp_WriteAttr                          0xe33
#define MAP_GATTServApp_WriteCharCfg                       0xe51
#define MAP_GATT_FindHandle                                0xd13
#define MAP_GATT_FindHandleUUID                            0xd0d
#define MAP_GATT_FindNextAttr                              0xd19
#define MAP_GATT_Indication                                0xd25
#define MAP_GATT_Init                                      0xd91
#define MAP_GATT_InitServer                                0xce9
#define MAP_GATT_Notification                              0xd2b
#define MAP_GATT_ProcessEvent                              0xd97
#define MAP_GATT_RegisterForReq                            0xcf5
#define MAP_GATT_RegisterService                           0xcef
#define MAP_GATT_ServiceChangedInd                         0xd07
#define MAP_GATT_ServiceNumAttrs                           0xd1f
#define MAP_GATT_VerifyReadPermissions                     0xcfb
#define MAP_GATT_VerifyWritePermissions                    0xd01
#define MAP_GGS_AddService                                 0xcd1
#define MAP_GGS_SetParameter                               0xccb
#define MAP_HCI_CommandCompleteEvent                       0xf29
#define MAP_HCI_CommandStatusEvent                         0xf35
#define MAP_HCI_DataBufferOverflowEvent                    0xf1d
#define MAP_HCI_DisconnectCmd                              0xe7b
#define MAP_HCI_EXT_ClkDivOnHaltCmd                        0xecf
#define MAP_HCI_EXT_DeclareNvUsageCmd                      0xed5
#define MAP_HCI_GAPTaskRegister                            0x1631
#define MAP_HCI_Init                                       0x1625
#define MAP_HCI_L2CAPTaskRegister                          0x1637
#define MAP_HCI_LE_AddWhiteListCmd                         0xeb7
#define MAP_HCI_LE_ClearWhiteListCmd                       0xeb1
#define MAP_HCI_LE_LtkReqNegReplyCmd                       0xec9
#define MAP_HCI_LE_LtkReqReplyCmd                          0xec3
#define MAP_HCI_LE_RandCmd                                 0xebd
#define MAP_HCI_LE_ReadBufSizeCmd                          0xe8d
#define MAP_HCI_LE_SetAdvDataCmd                           0xe9f
#define MAP_HCI_LE_SetAdvEnableCmd                         0xeab
#define MAP_HCI_LE_SetAdvParamCmd                          0xe99
#define MAP_HCI_LE_SetRandomAddressCmd                     0xe93
#define MAP_HCI_LE_SetScanRspDataCmd                       0xea5
#define MAP_HCI_NumOfCompletedPacketsEvent                 0xf23
#define MAP_HCI_ProcessEvent                               0x162b
#define MAP_HCI_ReadBDADDRCmd                              0xe81
#define MAP_HCI_ReadRssiCmd                                0xe87
#define MAP_HCI_SMPTaskRegister                            0x163d
#define MAP_HCI_SendCommandCompleteEvent                   0xf41
#define MAP_HCI_SendCommandStatusEvent                     0xf3b
#define MAP_HCI_SendControllerToHostEvent                  0xf47
#define MAP_HCI_SendDataPkt                                0xe75
#define MAP_HCI_TxDataBufferInsert                         0xef3
#define MAP_HCI_TxDataSend                                 0xef9
#define MAP_HCI_VendorSpecifcCommandCompleteEvent          0xf2f
#define MAP_HCI_bm_alloc                                   0xe6f
#define MAP_HalAdcInit                                     0x8b7
#define MAP_HalAdcRead                                     0x8bd
#define MAP_HalAdcSetReference                             0x8c3
#define MAP_HalAesInit                                     0x8cf
#define MAP_HalDmaInit                                     0x8d5
#define MAP_HalDriverInit                                  0x8e1
#define MAP_HalFlashErase                                  0x8ff
#define MAP_HalFlashRead                                   0x8f3
#define MAP_HalFlashWrite                                  0x8f9
#define MAP_HalKeyConfig                                   0x90b
#define MAP_HalKeyInit                                     0x905
#define MAP_HalKeyPoll                                     0x911
#define MAP_HalLedBlink                                    0x92f
#define MAP_HalLedInit                                     0x923
#define MAP_HalLedOnOff                                    0x93b
#define MAP_HalLedSet                                      0x929
#define MAP_HalLedUpdate                                   0x935
#define MAP_Hal_Init                                       0x8db
#define MAP_Hal_ProcessEvent                               0x8e7
#define MAP_Hal_ProcessPoll                                0x8ed
#define MAP_InitBoard                                      0x75b
#define MAP_L2CAP_BuildCmdReject                           0xfd1
#define MAP_L2CAP_CmdReject                                0xf83
#define MAP_L2CAP_ConnParamUpdateReq                       0xf89
#define MAP_L2CAP_Init                                     0xf8f
#define MAP_L2CAP_ParseParamUpdateReq                      0xfe3
#define MAP_L2CAP_ProcessEvent                             0xf95
#define MAP_L2CAP_RegisterApp                              0xf77
#define MAP_L2CAP_SendData                                 0xf7d
#define MAP_L2CAP_bm_alloc                                 0x101f
#define MAP_LL_AddWhiteListDevice                          0x108b
#define MAP_LL_ClearWhiteList                              0x1085
#define MAP_LL_ConnActive                                  0x10df
#define MAP_LL_ConnParamUpdateCback                        0xf59
#define MAP_LL_ConnectionCompleteCback                     0xf4d
#define MAP_LL_CtrlToHostFlowControl                       0x10a3
#define MAP_LL_Disconnect                                  0x10af
#define MAP_LL_DisconnectCback                             0xf53
#define MAP_LL_ENC_AES128_Encrypt                          0x1247
#define MAP_LL_ENC_Decrypt                                 0x1295
#define MAP_LL_ENC_DecryptMsg                              0x1283
#define MAP_LL_ENC_Encrypt                                 0x128f
#define MAP_LL_ENC_EncryptMsg                              0x127d
#define MAP_LL_ENC_GenDeviceIV                             0x123b
#define MAP_LL_ENC_GenDeviceSKD                            0x1235
#define MAP_LL_ENC_GenerateMIC                             0x1289
#define MAP_LL_ENC_GenerateNonce                           0x1241
#define MAP_LL_ENC_GeneratePseudoRandNum                   0x1229
#define MAP_LL_ENC_GenerateTrueRandNum                     0x122f
#define MAP_LL_ENC_InitAesDMA                              0x124d
#define MAP_LL_ENC_InitDMA0                                0x1253
#define MAP_LL_ENC_LoadEmptyIV                             0x1271
#define MAP_LL_ENC_LoadKey                                 0x1277
#define MAP_LL_ENC_MoveData                                0x1259
#define MAP_LL_ENC_ReverseBytes                            0x1223
#define MAP_LL_ENC_SetupCryptoDMA                          0x1265
#define MAP_LL_ENC_SetupLoadDMA                            0x125f
#define MAP_LL_ENC_StartAES                                0x126b
#define MAP_LL_EXT_ClkDivOnHalt                            0x10e5
#define MAP_LL_EXT_DeclareNvUsage                          0x10eb
#define MAP_LL_EXT_ExtendRfRangeCback                      0xeed
#define MAP_LL_EXT_SetRxGainCback                          0xee1
#define MAP_LL_EXT_SetTxPowerCback                         0xee7
#define MAP_LL_EncChangeCback                              0xf6b
#define MAP_LL_EncKeyRefreshCback                          0xf71
#define MAP_LL_EncLtkNegReply                              0x10d9
#define MAP_LL_EncLtkReply                                 0x10d3
#define MAP_LL_EncLtkReqCback                              0xf65
#define MAP_LL_Encrypt                                     0x1091
#define MAP_LL_Init                                        0x1067
#define MAP_LL_ProcessEvent                                0x106d
#define MAP_LL_PseudoRand                                  0x109d
#define MAP_LL_Rand                                        0x1097
#define MAP_LL_RandCback                                   0xedb
#define MAP_LL_ReadBDADDR                                  0x1079
#define MAP_LL_ReadRemoteVersionInfoCback                  0xf5f
#define MAP_LL_ReadRssi                                    0x10a9
#define MAP_LL_Reset                                       0x1073
#define MAP_LL_RxDataCompleteCback                         0xf0b
#define MAP_LL_RxReqDataBufCback                           0xf05
#define MAP_LL_SetAdvControl                               0x10c7
#define MAP_LL_SetAdvData                                  0x10c1
#define MAP_LL_SetAdvParam                                 0x10bb
#define MAP_LL_SetRandomAddress                            0x107f
#define MAP_LL_SetScanRspData                              0x10cd
#define MAP_LL_TxData                                      0x10b5
#define MAP_LL_TxDataCompleteCback                         0xf11
#define MAP_OnBoard_KeyCallback                            0x76d
#define MAP_OnBoard_SendKeys                               0x767
#define MAP_Onboard_rand                                   0x761
#define MAP_PHY_AddWlEntry                                 0x13f7
#define MAP_PHY_ClearAllRegsAndFifos                       0x13a9
#define MAP_PHY_ClearBlacklist                             0x140f
#define MAP_PHY_ClearBlacklistIndex                        0x1409
#define MAP_PHY_ClearSavedWhiteList                        0x1415
#define MAP_PHY_ClearWhitelist                             0x13f1
#define MAP_PHY_CommitRxFifo                               0x143f
#define MAP_PHY_ConfigWhitener                             0x142d
#define MAP_PHY_ConfigureAppendRfStatus                    0x1421
#define MAP_PHY_ConfigureFifoDataProcessing                0x141b
#define MAP_PHY_ConfigureMD                                0x13d3
#define MAP_PHY_DeallocateRxFifo                           0x1445
#define MAP_PHY_GetAdvChans                                0x13c1
#define MAP_PHY_GetEndCause                                0x13d9
#define MAP_PHY_Init                                       0x1391
#define MAP_PHY_InitSeqStat                                0x13df
#define MAP_PHY_LoadNR                                     0x139d
#define MAP_PHY_Reset                                      0x1397
#define MAP_PHY_RetryRxFifo                                0x1439
#define MAP_PHY_RetryTxFifo                                0x1433
#define MAP_PHY_SetAdvChans                                0x13c7
#define MAP_PHY_SetAdvWlPolicy                             0x13fd
#define MAP_PHY_SetBlacklistIndex                          0x1403
#define MAP_PHY_SetCRCInit                                 0x13bb
#define MAP_PHY_SetEndConnection                           0x13cd
#define MAP_PHY_SetFifoConfig                              0x1427
#define MAP_PHY_SetMaxNack                                 0x13eb
#define MAP_PHY_SetOwnAddr                                 0x13af
#define MAP_PHY_SetPeerAddr                                0x13b5
#define MAP_PHY_SetRfFreq                                  0x144b
#define MAP_PHY_SetSyncWord                                0x13e5
#define MAP_PHY_VerifyNR                                   0x13a3
#define MAP_SM_CalcRandomAddr                              0x1457
#define MAP_SM_GenerateAuthenSig                           0x1463
#define MAP_SM_Init                                        0x1589
#define MAP_SM_PasskeyUpdate                               0x14cf
#define MAP_SM_ProcessEvent                                0x158f
#define MAP_SM_ResolveRandomAddrs                          0x145d
#define MAP_SM_ResponderInit                               0x155f
#define MAP_SM_StartPairing                                0x14c9
#define MAP_SM_VerifyAuthenSig                             0x1469
#define MAP_SimpleBLEPeripheral_Init                       0x9ef
#define MAP_SimpleBLEPeripheral_ProcessEvent               0x9f5
#define MAP_SimpleProfile_AddService                       0xa3d
#define MAP_SimpleProfile_GetParameter                     0xa4f
#define MAP_SimpleProfile_RegisterAppCBs                   0xa43
#define MAP_SimpleProfile_SetParameter                     0xa49
#define MAP_accInit                                        0x7cd
#define MAP_accReadAcc                                     0x7df
#define MAP_accReadReg                                     0x7d9
#define MAP_accSetFreeFallEvent                            0x7e5
#define MAP_accWriteReg                                    0x7d3
#define MAP_accelEnablerChangeCB                           0xa13
#define MAP_accelRead                                      0xa07
#define MAP_accel_HandleConnStatusCB                       0x797
#define MAP_accel_ReadAttrCB                               0x78b
#define MAP_accel_WriteAttrCB                              0x791
#define MAP_aesDmaInit                                     0x8c9
#define MAP_attSendMsg                                     0xb3f
#define MAP_battMeasure                                    0x7b5
#define MAP_battProfileChangeCB                            0xa19
#define MAP_battReadAttrCB                                 0x7a9
#define MAP_battWriteAttrCB                                0x7af
#define MAP_bm_desc_from_payload                           0x953
#define MAP_cleanErasedPage                                0x983
#define MAP_compactPage                                    0x99b
#define MAP_devInfo_ReadAttrCB                             0x7c7
#define MAP_disconnectNext                                 0xc1d
#define MAP_erasePage                                      0x97d
#define MAP_findItem                                       0x98f
#define MAP_findOffset                                     0x989
#define MAP_gapAddAddrAdj                                  0xb7b
#define MAP_gapBondMgrAddBond                              0x857
#define MAP_gapBondMgrAuthenticate                         0x89f
#define MAP_gapBondMgrBondReq                              0x8a5
#define MAP_gapBondMgrBondTotal                            0x875
#define MAP_gapBondMgrChangeState                          0x83f
#define MAP_gapBondMgrEraseAllBondings                     0x87b
#define MAP_gapBondMgrEraseBonding                         0x881
#define MAP_gapBondMgrFindAddr                             0x863
#define MAP_gapBondMgrFindCharCfgItem                      0x84b
#define MAP_gapBondMgrGetPublicAddr                        0x85d
#define MAP_gapBondMgrInvertCharCfgItem                    0x851
#define MAP_gapBondMgrReadBonds                            0x86f
#define MAP_gapBondMgrResolvePrivateAddr                   0x869
#define MAP_gapBondMgrSendServiceChange                    0x893
#define MAP_gapBondMgrUpdateCharCfg                        0x845
#define MAP_gapBondMgr_SyncCharCfg                         0x8b1
#define MAP_gapBondMgr_SyncWhiteList                       0x8ab
#define MAP_gapBondSetupPrivFlag                           0x899
#define MAP_gapDetermineAddrType                           0xb81
#define MAP_gapFindADType                                  0xbcf
#define MAP_gapFreeAdvertState                             0xc8f
#define MAP_gapFreeAuthLink                                0xc29
#define MAP_gapFreeEstLink                                 0xc2f
#define MAP_gapGetDevAddress                               0xbab
#define MAP_gapGetDevAddressMode                           0xba5
#define MAP_gapGetIRK                                      0xbb1
#define MAP_gapGetSRK                                      0xb8d
#define MAP_gapGetSignCounter                              0xb93
#define MAP_gapIncSignCounter                              0xb99
#define MAP_gapIsAdvertising                               0xbc3
#define MAP_gapPairingCompleteCB                           0xc47
#define MAP_gapPasskeyNeededCB                             0xc41
#define MAP_gapPeriProcessHCICmdCompleteEvt                0xc65
#define MAP_gapProcessAdvertisingEvt                       0xc83
#define MAP_gapProcessConnUpdateCompleteEvt                0xbff
#define MAP_gapProcessConnectionCompleteEvt                0xbf9
#define MAP_gapProcessDisconnectCompleteEvt                0xc05
#define MAP_gapProcessHCICmdCompleteEvt                    0xcbf
#define MAP_gapProcessNewAddr                              0xb75
#define MAP_gapProcessOSALMsg                              0xcb9
#define MAP_gapProcessRandomAddrComplete                   0xb87
#define MAP_gapReadBD_ADDRStatus                           0xb69
#define MAP_gapReadBufSizeCmdStatus                        0xb6f
#define MAP_gapRegisterPeripheral                          0xcc5
#define MAP_gapRole_ProcessGAPMsg                          0x9e3
