nthuepl/CodeGenerator/python/sdcc/cc2540relay.h
#define MAP_gapSendBondCompleteEvent                       0xc35
#define MAP_gapSendDeviceInitDoneEvent                     0xbb7
#define MAP_gapSendLinkUpdateEvent                         0xc17
#define MAP_gapSendMakeDiscEvent                           0xc89
#define MAP_gapSendPairingReqEvent                         0xc3b
#define MAP_gapSetAdvParams                                0xc6b
#define MAP_gapSetAdvParamsStatus                          0xc71
#define MAP_gapUpdateConnSignCounter                       0xb9f
#define MAP_gapValidADType                                 0xbc9
#define MAP_gapWriteAdvDataStatus                          0xc7d
#define MAP_gapWriteAdvEnableStatus                        0xc77
#define MAP_gattFindServerInfo                             0xd79
#define MAP_gattGetServerStatus                            0xd73
#define MAP_gattNotifyEvent                                0xda3
#define MAP_gattProcessExchangeMTUReq                      0xd3d
#define MAP_gattProcessExecuteWriteReq                     0xd6d
#define MAP_gattProcessFindByTypeValueReq                  0xd49
#define MAP_gattProcessFindInfoReq                         0xd43
#define MAP_gattProcessReadByGrpTypeReq                    0xd61
#define MAP_gattProcessReadByTypeReq                       0xd4f
#define MAP_gattProcessReadMultiReq                        0xd5b
#define MAP_gattProcessReadReq                             0xd55
#define MAP_gattProcessRxData                              0xd9d
#define MAP_gattProcessWriteReq                            0xd67
#define MAP_gattRegisterServer                             0xd8b
#define MAP_gattServApp_FindAuthorizeAttrCB                0xe21
#define MAP_gattServApp_FindCharCfgItem                    0xe1b
#define MAP_gattServApp_FindPrepareWriteQ                  0xe15
#define MAP_gattServApp_FindServiceCBs                     0xddf
#define MAP_gattServApp_HandleConnStatusCB                 0xe63
#define MAP_gattServApp_ProcessExecuteWriteReq             0xe0f
#define MAP_gattServApp_ProcessFindByTypeValueReq          0xdeb
#define MAP_gattServApp_ProcessMsg                         0xde5
#define MAP_gattServApp_ProcessPrepareWriteReq             0xe09
#define MAP_gattServApp_ProcessReadByGrpTypeReq            0xdfd
#define MAP_gattServApp_ProcessReadByTypeReq               0xdf1
#define MAP_gattServApp_ProcessReadMultiReq                0xdf7
#define MAP_gattServApp_ProcessWriteReq                    0xe03
#define MAP_gattServApp_SetNumPrepareWrites                0xdcd
#define MAP_gattServApp_WriteAttrCB                        0xe27
#define MAP_gattServerHandleConnStatusCB                   0xd85
#define MAP_gattServerHandleTimerCB                        0xd7f
#define MAP_gattServerProcessMsgCB                         0xd37
#define MAP_gattServiceLastHandle                          0xd31
#define MAP_gattStartTimer                                 0xda9
#define MAP_gattStopTimer                                  0xdaf
#define MAP_generate_subkey                                0x14b7
#define MAP_ggs_ReadAttrCB                                 0xcdd
#define MAP_ggs_SetAttrWPermit                             0xcd7
#define MAP_ggs_WriteAttrCB                                0xce3
#define MAP_halGetJoyKeyInput                              0x917
#define MAP_halProcessAlarmInterrupt                       0x63b
#define MAP_halProcessFreeFallInterrupt                    0x641
#define MAP_halProcessKeyInterrupt                         0x91d
#define MAP_hciInitEventMasks                              0xf17
#define MAP_hciTxDataBufferReset                           0xeff
#define MAP_initNV                                         0x971
#define MAP_isLimitedDiscoverableMode                      0xc95
#define MAP_l2capAllocChannel                              0xffb
#define MAP_l2capBuildParamUpdateReq                       0xfdd
#define MAP_l2capEncapSendData                             0xfc5
#define MAP_l2capFindLocalId                               0x1007
#define MAP_l2capFreeChannel                               0x1001
#define MAP_l2capHandleRxError                             0x1019
#define MAP_l2capHandleTimerCB                             0x1013
#define MAP_l2capNotifyData                                0xfef
#define MAP_l2capNotifySignal                              0xff5
#define MAP_l2capParseCmdReject                            0xfd7
#define MAP_l2capParsePacket                               0xfcb
#define MAP_l2capParseParamUpdateRsp                       0xfe9
#define MAP_l2capParseSignalHdr                            0xfb3
#define MAP_l2capProcessReq                                0xfad
#define MAP_l2capProcessRsp                                0xfa7
#define MAP_l2capProcessRxData                             0xf9b
#define MAP_l2capProcessSignal                             0xfa1
#define MAP_l2capSendCmd                                   0xfbf
#define MAP_l2capSendReq                                   0xfb9
#define MAP_l2capStopTimer                                 0x100d
#define MAP_leftshift_onebit                               0x14c3
#define MAP_linkDB_Add                                     0x1031
#define MAP_linkDB_Authen                                  0x1055
#define MAP_linkDB_Find                                    0x103d
#define MAP_linkDB_FindFirst                               0x1043
#define MAP_linkDB_Init                                    0x1025
#define MAP_linkDB_NumActive                               0x104f
#define MAP_linkDB_PerformFunc                             0x105b
#define MAP_linkDB_Register                                0x102b
#define MAP_linkDB_Remove                                  0x1037
#define MAP_linkDB_State                                   0x1049
#define MAP_llAdjustForMissedEvent                         0x1205
#define MAP_llAdvEvt_TaskAbort                             0x110f
#define MAP_llAdvEvt_TaskConnect                           0x10f7
#define MAP_llAllocConnId                                  0x11cf
#define MAP_llAllocTask                                    0x12bf
#define MAP_llCheckForLstoDuringSL                         0x1331
#define MAP_llClearRfInts                                  0x112d
#define MAP_llClearSetInts                                 0x1121
#define MAP_llConnCleanup                                  0x11e7
#define MAP_llConnTerminate                                0x11ed
#define MAP_llConvertCtrlProcTimeoutToEvent                0x11ff
#define MAP_llConvertLstoToEvent                           0x11f9
#define MAP_llDequeueCtrlPkt                               0x11bd
#define MAP_llDirectedAdvEvt_TaskEndOk                     0x10f1
#define MAP_llDisableRfInts                                0x1127
#define MAP_llDisableT2E1                                  0x1373
#define MAP_llDisableT2Ints                                0x1367
#define MAP_llDisableT2IntsEvts                            0x136d
#define MAP_llDiscoverableAdvEvt_TaskEndOk                 0x1103
#define MAP_llEnableRfInts                                 0x1133
#define MAP_llEnqueueCtrlPkt                               0x11b7
#define MAP_llExtendRfRange                                0x1151
#define MAP_llFindNextSecTask                              0x12b9
#define MAP_llFindStartType                                0x12b3
#define MAP_llFindTxPowerSettings                          0x114b
#define MAP_llFreeTask                                     0x12c5
#define MAP_llGetActiveTasks                               0x12d7
#define MAP_llGetCurrentFineTime                           0x1385
#define MAP_llGetCurrentTask                               0x12cb
#define MAP_llGetCurrentTime                               0x137f
#define MAP_llGetNextConn                                  0x11e1
#define MAP_llGetNumTasks                                  0x12e3
#define MAP_llGetTask                                      0x12dd
#define MAP_llGetTaskState                                 0x12d1
#define MAP_llGetTimer2Capture                             0x1379
#define MAP_llInitFeatureSet                               0x11f3
#define MAP_llInitTimer2                                   0x1337
#define MAP_llMemCopyDst                                   0x121d
#define MAP_llMemCopySrc                                   0x1217
#define MAP_llNonConnAdvEvt_TaskEndOk                      0x1109
#define MAP_llProcessChanMap                               0x11c9
#define MAP_llProcessPendingTxData                         0x120b
#define MAP_llProcessPostRfOps                             0x1139
#define MAP_llProcessSlaveControlProcedures                0x132b
#define MAP_llReleaseAllConnId                             0x11db
#define MAP_llReleaseConnId                                0x11d5
#define MAP_llReplaceCtrlPkt                               0x11c3
#define MAP_llRestoreConnState                             0x1313
#define MAP_llRestoreRfRegs                                0x1307
#define MAP_llRestore_rxFIFO                               0x12fb
#define MAP_llRestore_txFIFO                               0x12f5
#define MAP_llRfInit                                       0x1115
#define MAP_llSaveConnState                                0x130d
#define MAP_llSaveRfRegs                                   0x1301
#define MAP_llSave_rxFIFO                                  0x12ef
#define MAP_llSave_txFIFO                                  0x12e9
#define MAP_llScheduleTask                                 0x12ad
#define MAP_llScheduler                                    0x12a7
#define MAP_llSchedulerInit                                0x12a1
#define MAP_llSetFreqTune                                  0x111b
#define MAP_llSetRxGain                                    0x113f
#define MAP_llSetT2C1Event1                                0x134f
#define MAP_llSetT2Delta                                   0x1361
#define MAP_llSetT2OVFC1Event1                             0x1355
#define MAP_llSetT2OVFC1Timeout                            0x1349
#define MAP_llSetT2OVFC2Event2                             0x135b
#define MAP_llSetTxPower                                   0x1145
#define MAP_llSetupAdv                                     0x1157
#define MAP_llSetupDirectedAdvEvt                          0x115d
#define MAP_llSetupEncRsp                                  0x1181
#define MAP_llSetupFeatureSetRsp                           0x119f
#define MAP_llSetupNextSlaveEvent                          0x1325
#define MAP_llSetupNonConnectableAdvEvt                    0x1169
#define MAP_llSetupPauseEncRsp                             0x1193
#define MAP_llSetupRejectInd                               0x1199
#define MAP_llSetupScannableAdvEvt                         0x116f
#define MAP_llSetupStartEncReq                             0x1187
#define MAP_llSetupStartEncRsp                             0x118d
#define MAP_llSetupTermInd                                 0x11ab
#define MAP_llSetupUndirectedAdvEvt                        0x1163
#define MAP_llSetupUnknownRsp                              0x11b1
#define MAP_llSetupVersionIndReq                           0x11a5
#define MAP_llSlaveEvt_TaskAbort                           0x131f
#define MAP_llSlaveEvt_TaskEndOk                           0x1319
#define MAP_llStartAdvSetup                                0x1175
#define MAP_llStartSlaveSetup                              0x117b
#define MAP_llStartTimer2                                  0x1343
#define MAP_llStopTimer2                                   0x133d
#define MAP_llUndirectedAdvEvt_TaskEndOk                   0x10fd
#define MAP_llUnexpectedEndCauseHandler                    0x129b
#define MAP_llWriteTxData                                  0x1211
#define MAP_ll_McuPrecisionCount                           0x138b
#define MAP_memset                                         0x689
#define MAP_osalAddTimer                                   0x725
#define MAP_osalDeleteTimer                                0x731
#define MAP_osalFindTimer                                  0x72b
#define MAP_osalInitTasks                                  0x719
#define MAP_osalTimeUpdate                                 0x6ef
#define MAP_osalTimerInit                                  0x71f
#define MAP_osalTimerUpdate                                0x74f
#define MAP_osal_CbTimerInit                               0x959
#define MAP_osal_CbTimerProcessEvent                       0x95f
#define MAP_osal_CbTimerStart                              0x965
#define MAP_osal_CbTimerStop                               0x96b
#define MAP_osal_GetSystemClock                            0x755
#define MAP_osal_bm_adjust_header                          0x94d
#define MAP_osal_bm_alloc                                  0x941
#define MAP_osal_bm_free                                   0x947
#define MAP_osal_clear_event                               0x6cb
#define MAP_osal_get_timeoutEx                             0x749
#define MAP_osal_init_system                               0x6d7
#define MAP_osal_int_disable                               0x6d1
#define MAP_osal_isbufset                                  0x6e9
#define MAP_osal_mem_alloc                                 0x701
#define MAP_osal_mem_free                                  0x707
#define MAP_osal_mem_init                                  0x6f5
#define MAP_osal_mem_kick                                  0x6fb
#define MAP_osal_memcmp                                    0x683
#define MAP_osal_memcpy                                    0x671
#define MAP_osal_memdup                                    0x67d
#define MAP_osal_memset                                    0x689
#define MAP_osal_msg_allocate                              0x695
#define MAP_osal_msg_deallocate                            0x69b
#define MAP_osal_msg_enqueue                               0x6b3
#define MAP_osal_msg_enqueue_push                          0x6a7
#define MAP_osal_msg_extract                               0x6bf
#define MAP_osal_msg_push                                  0x6b9
#define MAP_osal_msg_receive                               0x6ad
#define MAP_osal_msg_send                                  0x6a1
#define MAP_osal_pwrmgr_init                               0x70d
#define MAP_osal_pwrmgr_task_state                         0x713
#define MAP_osal_rand                                      0x68f
#define MAP_osal_revmemcpy                                 0x677
#define MAP_osal_run_system                                0x6e3
#define MAP_osal_set_event                                 0x6c5
#define MAP_osal_snv_init                                  0x9ad
#define MAP_osal_snv_read                                  0x9b9
#define MAP_osal_snv_write                                 0x9b3
#define MAP_osal_start_reload_timer                        0x73d
#define MAP_osal_start_system                              0x6dd
#define MAP_osal_start_timerEx                             0x737
#define MAP_osal_stop_timerEx                              0x743
#define MAP_osal_strlen                                    0x66b
#define MAP_peripheralStateNotificationCB                  0x9fb
#define MAP_phyFindWlEntry                                 0x1451
#define MAP_reportStatusChange                             0x1061
#define MAP_sendAuthEvent                                  0xc23
#define MAP_sendEstLinkEvent                               0xc0b
#define MAP_sendTerminateEvent                             0xc11
#define MAP_setActivePage                                  0x977
#define MAP_simpleProfileChangeCB                          0xa0d
#define MAP_simpleProfile_HandleConnStatusCB               0xa61
#define MAP_simpleProfile_ReadAttrCB                       0xa55
#define MAP_simpleProfile_WriteAttrCB                      0xa5b
#define MAP_smAuthReqToUint8                               0x149f
#define MAP_smDetermineKeySize                             0x1553
#define MAP_smEncrypt                                      0x14ab
#define MAP_smEndPairing                                   0x154d
#define MAP_smFreePairingParams                            0x1547
#define MAP_smGenerateConfirm                              0x1517
#define MAP_smGeneratePairingReqRsp                        0x1511
#define MAP_smGenerateRandBuf                              0x1499
#define MAP_smGenerateRandMsg                              0x151d
#define MAP_smLinkCheck                                    0x14db
#define MAP_smNextPairingState                             0x14f9
#define MAP_smPairingSendEncInfo                           0x1529
#define MAP_smPairingSendIdentityAddrInfo                  0x153b
#define MAP_smPairingSendIdentityInfo                      0x1535
#define MAP_smPairingSendMasterID                          0x152f
#define MAP_smPairingSendSingingInfo                       0x1541
#define MAP_smProcessDataMsg                               0x14e7
#define MAP_smProcessEncryptChange                         0x14f3
#define MAP_smProcessOSALMsg                               0x1595
#define MAP_smProcessPairingReq                            0x1505
#define MAP_smProcessRandComplete                          0x146f
#define MAP_smRegisterResponder                            0x14d5
#define MAP_smResponderProcessLTKReq                       0x1565
#define MAP_smResponderSendNextKeyInfo                     0x1583
#define MAP_smSavePairInfo                                 0x1523
#define MAP_smSendFailAndEnd                               0x14ed
#define MAP_smSendSMMsg                                    0x161f
#define MAP_smSetPairingReqRsp                             0x1559
#define MAP_smStartEncryption                              0x150b
#define MAP_smStartRspTimer                                0x1475
#define MAP_smStopRspTimer                                 0x147b
#define MAP_smTimedOut                                     0x14e1
#define MAP_smUint8ToAuthReq                               0x14a5
#define MAP_sm_CMAC                                        0x14b1
#define MAP_sm_ah                                          0x1481
#define MAP_sm_c1                                          0x14ff
#define MAP_sm_c1new                                       0x1487
#define MAP_sm_s1                                          0x1493
#define MAP_sm_xor                                         0x148d
#define MAP_smpBuildEncInfo                                0x15d7
#define MAP_smpBuildIdentityAddrInfo                       0x15f5
#define MAP_smpBuildIdentityInfo                           0x15ef
#define MAP_smpBuildMasterID                               0x15e3
#define MAP_smpBuildPairingConfirm                         0x15b3
#define MAP_smpBuildPairingFailed                          0x15cb
#define MAP_smpBuildPairingRandom                          0x15bf
#define MAP_smpBuildPairingReq                             0x159b
#define MAP_smpBuildPairingReqRsp                          0x15a7
#define MAP_smpBuildPairingRsp                             0x15a1
#define MAP_smpBuildSecurityReq                            0x1613
#define MAP_smpBuildSigningInfo                            0x1607
#define MAP_smpParseEncInfo                                0x15dd
#define MAP_smpParseIdentityAddrInfo                       0x1601
#define MAP_smpParseIdentityInfo                           0x15fb
#define MAP_smpParseMasterID                               0x15e9
#define MAP_smpParsePairingConfirm                         0x15b9
#define MAP_smpParsePairingFailed                          0x15d1
#define MAP_smpParsePairingRandom                          0x15c5
#define MAP_smpParsePairingReq                             0x15ad
#define MAP_smpParseSecurityReq                            0x1619
#define MAP_smpParseSigningInfo                            0x160d
#define MAP_smpResponderProcessIncoming                    0x156b
#define MAP_smpResponderProcessMasterID                    0x157d
#define MAP_smpResponderProcessPairingRandom               0x1577
#define MAP_smpResponderProcessPairingReq                  0x1571
#define MAP_spiInit                                        0x7f7
#define MAP_spiReadByte                                    0x7f1
#define MAP_spiWriteByte                                   0x7eb
#define MAP_strlen                                         0x66b
#define MAP_uartInit                                       0x7fd
#define MAP_uartWriteByte                                  0x803
#define MAP_uartWriteString                                0x809
#define MAP_verInfo                                        0xd79
#define MAP_verifyWordM                                    0x9a1
#define MAP_writeItem                                      0x995
#define MAP_writeWord                                      0x9a7
#define MAP_xor_128                                        0x14bd
#define MAP_notify                                         0x696
#define MAP_simpleBLEPeripheral_TaskID                     0x7ad
#define MAP_accelEnabler                                   0x494
#define MAP_attDeviceName                                  0xfbb
